/* NSExecutableNotLoadableError */
"BundleErr3584" = "Nippua ”%@” ei voitu ladata, koska sen ohjelmaa ei voida ladata.";

/* NSExecutableNotLoadableError */
"BundleErr3584-C" = "Nipun ohjelmaa ei voida ladata.";

/* NSExecutableNotLoadableError */
"BundleErr3584-R" = "Asenna nippu uudelleen.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585" = "Nippua ”%@” ei voitu ladata, koska se ei sisällä nykyiselle arkkitehtuurille sopivaa versiota.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-C" = "Nippu ei sisällä nykyiselle arkkitehtuurille sopivaa versiota.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-R" = "Asenna nipusta universal-versio.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586" = "Nippua ”%@” ei voitu ladata, koska se ei ole yhteensopiva nykyisen ohjelman kanssa.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-C" = "Nippu ei ole yhteensopiva tämän ohjelman kanssa.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-R" = "Asenna nipusta uudempi versio.";

/* NSExecutableLoadError */
"BundleErr3587" = "Nippua ”%@” ei voitu ladata, koska se on vioittunut tai siitä puuttuu tarvittavia resursseja.";

/* NSExecutableLoadError */
"BundleErr3587-C" = "Nippu on vioittunut tai siitä puuttuu tarvittavia resursseja.";

/* NSExecutableLoadError */
"BundleErr3587-R" = "Asenna nippu uudelleen.";

/* NSExecutableLinkError */
"BundleErr3588" = "Nippua ”%@” ei voitu ladata.";

/* NSExecutableLinkError */
"BundleErr3588-C" = "Nippua ei voitu ladata.";

/* NSExecutableLinkError */
"BundleErr3588-R" = "Asenna nippu uudelleen.";

/* NSFileNoSuchFileError */
"BundleErr4" = "Nippua ”%@” ei voitu ladata, koska sen ohjelmaa ei löytynyt.";

/* NSFileNoSuchFileError */
"BundleErr4-C" = "Nipun ohjelmaa ei löytynyt.";

/* NSFileNoSuchFileError */
"BundleErr4-R" = "Asenna nippu uudelleen.";

/* Name of the 'Cocoa' error domain when showing to user. Very likely this will not get localized. */
"NSCocoaErrorDomain" = "Cocoa";

/* Name of the 'Core Foundation' error domain when showing to user. Very likely this will not get localized differently in other languages. */
"NSCoreFoundationErrorDomain" = "Core Foundation";

/* Name of the 'Mach' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'Mach' in the language. */
"NSMachErrorDomain" = "Mach";

/* Name of the 'OSStatus' error domain when showing to user. Very likely this will not get localized. */
"NSOSStatusErrorDomain" = "OSStatus";

/* Name of the 'POSIX' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'POSIX' in the language. */
"NSPOSIXErrorDomain" = "POSIX";

/* A generic error string indicating there was a problem. The %@ will be replaced by a second sentence which indicates why the operation failed. */
"Operation could not be completed. %@" = "Toimintoa ei voitu suorittaa. %@";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain, code, and a description when there is no other way to present an error to the user. The first %@ indicates the error domain, %ld indicates the error code, and the second %@ indicates the description; so this might become '(Mach error 42 - Server error.)' for instance. */
"Operation could not be completed. (%@ error %ld - %@)" = "Toimintoa ei voitu suorittaa. (%1$@ virhe %2$ld - %3$@)";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain and code when there is no other way to present an error to the user. The %@ indicates the error domain while %ld indicates the error code; so this might become '(Mach error 42.)' for instance. */
"Operation could not be completed. (%@ error %ld.)" = "Toimintoa ei voitu suorittaa. (%1$@ virhe %2$ld.)";

